W4/W4D3/ninety_nine_cats_II/app/controllers/cat_rental_requests_controller.rb

  def create
    full_parameters = cat_rental_request_params
    full_parameters[:user_id] = current_user.id

    @rental_request = CatRentalRequest.new(full_parameters)
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"