W4/W4D3/ninety_nine_cats_II/app/controllers/cats_controller.rb

  def create
    full_parameters = cat_params
    full_parameters[:user_id] = current_user.id
    @cat = Cat.new(full_parameters)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "description", "name", "sex", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @cat = current_user.cats.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 2]]

  def update
    @cat = current_user.cats.find_by(id: params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 2]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "brown"], ["sex", "M"], ["updated_at", "2017-06-21 23:45:31.685860"], ["id", 2]]