W4/W4D3/ninety_nine_cats_II/app/views/cats/_req_tr.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  <td>
    <%= User.find_by(id: req.user_id).user_name %>